---
title: ExportLayerKey
classe: Autodesk.Revit.DB.ExportLayerKey
namespace: Autodesk.Revit.DB
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 5
---

# ExportLayerKey

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `String CategoryName { get; set; }` | `exportLayerKey.CategoryName` | String |
| `Boolean IsValidObject { get; }` | `exportLayerKey.IsValidObject` | Boolean |
| `SpecialType SpecialType { get; set; }` | `exportLayerKey.SpecialType` | SpecialType |
| `String SubCategoryName { get; set; }` | `exportLayerKey.SubCategoryName` | String |
| `Void Dispose()` | `exportLayerKey.Dispose()` | Void |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```